app/controllers/comments_controller.rb

	def create
		@post = Post.find(params[:post_id])
	 	@comment = @post.comments.create(params[:comment].permit(:name, :comment))
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("name", "comment", "created_at", "updated_at", "post_id") VALUES (?, ?, ?, ?, ?)  [["name", "Mawar Faizal"], ["comment", "Nice blog."], ["created_at", "2020-12-24 09:00:38.255902"], ["updated_at", "2020-12-24 09:00:38.255902"], ["post_id", 1]]