app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY created_at DESC LIMIT ? OFFSET ?  [["LIMIT", 4], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts"
---
	def index
		@posts = Post.paginate(page: params[:page], per_page: 4).order("created_at DESC")

INSERT INTO "posts" ("title", "content", "created_at", "updated_at", "authentication_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Hello"], ["content", "Hi everyone"], ["created_at", "2020-12-30 06:46:02.187960"], ["updated_at", "2020-12-30 06:46:02.187960"], ["authentication_id", 1]]
---
	def create
		@post = current_authentication.posts.build(post_params)

		respond_to do |format|
			if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."authentication_id" = $1 AND "posts"."id" = $2 LIMIT $3  [["authentication_id", 2], ["id", 1], ["LIMIT", 1]]
---
	def correct_authentication
		@post = current_authentication.posts.find_by(id: params[:id])